--PXMMA_軍福品共用參數設定作業
SELECT
  ,MA001 AS "代送商進貨單別"
  ,MA002 AS "代送商回籠單別"
  ,MA003 AS "代送商銷貨單別"
  ,MA004 AS "代送商銷退單別"
  ,MA005 AS "代送商佣金應付憑單單別"
  ,MA006 AS "代送商結帳單單別"
  ,MA007 AS "福總回籠單別"
  ,MA008 AS "福總銷貨單別"
  ,MA009 AS "福總銷退單別"
  ,MA010 AS "全聯社回籠單別"
  ,MA011 AS "全聯社銷貨單別"
  ,MA012 AS "全聯社銷退單別"
  ,MA013 AS "縣市聯社回籠單別"
  ,MA014 AS "縣市聯社銷貨單別(二聯)"
  ,MA015 AS "縣市聯社銷退單別"
  ,MA016 AS "縣市聯社銷貨單別(三聯)"
  ,MA017 AS "福總(副食)回籠單別"
  ,MA018 AS "福總(副食)銷貨單別"
  ,MA019 AS "福總(副食)銷退單別"
  ,MA020 AS "軍福品現行年月"
  ,CASE 
   WHEN '1' THEN N'進貨單'
   WHEN '2' THEN N'銷退單'
   ELSE ""
   END AS "自結作業方式"
  ,CASE 
   WHEN '1' THEN N'進貨數量由回籠單產生'
   WHEN '2' THEN N'進貨數量自動產生回籠單'
   ELSE ""
   END AS "縣市聯社作業方式"
  ,MA023 AS "執行回籠單流程"
  ,MA024 AS "銷售額依福總總數計算"
  ,MA025 AS "稅額依福總總數計算"
  ,MA026 AS "銷售額依全聯社總數計算"
  ,MA027 AS "稅額依全聯社總數計算"
  ,MA028 AS "銷售額依福總(副食)總數計算"
  ,MA029 AS "稅額依福總(副食)總數計算"

FROM PXMMA
