--PALMA_基本條件設定檔
SELECT
  ,MA001 AS "分上下月發薪"
  ,MA002 AS "日薪(上)計出勤"
  ,MA003 AS "日薪固定發薪幾天"
  ,MA004 AS "月薪(上)底薪幾倍"
  ,MA005 AS "月薪換日薪除何值"
  ,MA006 AS "每小時之基數"
  ,MA007 AS "特休之請假扣款項目代號"
  ,MA008 AS "有刷卡系統"
  ,MA009 AS "上半月截止日期"
  ,MA010 AS "補休之請假扣款項目代號"
  ,MA011 AS "試用期滿日天數"
  ,MA012 AS "請假單起算日期"
  ,MA013 AS "加班單起算日期"
  ,CASE 
   WHEN '1' THEN N'拋轉自動分錄底稿'
   WHEN '2' THEN N'拋轉自動分錄底稿及會計傳票'
   ELSE ""
   END AS "拋轉方式"
  ,MA015 AS "拋轉傳票同底稿科目彙總"
  ,MA016 AS "借支金額科目"
  ,MA017 AS "薪資傳票單別"
  ,MA018 AS "借方摘要來源"
  ,MA019 AS "貸方摘要來源"
  ,MA020 AS "代扣健保費"
  ,MA021 AS "代扣勞保費"
  ,MA022 AS "代扣所得稅"
  ,MA023 AS "應付費用科目"
  ,MA024 AS "請假單上半月截止日期"
  ,MA025 AS "加班單上半月截止日期"
  ,MA026 AS "上半月僅發放借支"
  ,CASE 
   WHEN '1' THEN N'依借貸方'
   WHEN '2' THEN N'依原底稿'
   ELSE ""
   END AS "拋轉傳票排列方式"
  ,MA028 AS "假日加班費率計算方式"
  ,MA029 AS "雇主負擔退休金提撥率"
  ,MA030 AS "底薪換算每小時加班費基數"
  ,MA032 AS "下半月全月給薪日"
  ,MA034 AS "代扣員工自提退休金"
  ,MA035 AS "稅額不足扣款項目"
  ,MA038 AS "舊制退休準備金比率"

FROM PALMA
