--VPAMA_基本條件設定檔
SELECT
  ,MA001 AS "分上下月發薪"
  ,MA002 AS "日薪(上)計出勤"
  ,MA003 AS "日薪固定發薪幾天"
  ,MA004 AS "月薪(上)底薪幾倍"
  ,MA005 AS "月薪換日薪除何值"
  ,MA006 AS "每小時之基數"
  ,MA007 AS "年假之請假扣款項目代號"
  ,MA008 AS "有刷卡系統"
  ,MA009 AS "上半月截止日期"
  ,MA010 AS "補休之請假扣款項目代號"
  ,MA011 AS "試用期滿日天數"
  ,MA012 AS "請假單起算日期"
  ,MA013 AS "加班單起算日期"
  ,CASE 
   WHEN '1' THEN N'拋轉自動分錄底稿'
   WHEN '2' THEN N'拋轉自動分錄底稿及會計傳票'
   ELSE ""
   END AS "拋轉方式"
  ,MA015 AS "拋轉傳票同底稿科目彙總"
  ,MA016 AS "借支金額科目"
  ,MA017 AS "薪資傳票單別"
  ,MA018 AS "借方摘要來源"
  ,MA019 AS "貸方摘要來源"
  ,MA020 AS "代扣保險費一"
  ,MA021 AS "代扣保險費二"
  ,MA022 AS "代扣所得稅"
  ,MA023 AS "應付費用科目"
  ,MA024 AS "請假單上半月截止日期"
  ,MA025 AS "加班單上半月截止日期"
  ,MA026 AS "上半月僅發放借支"
  ,CASE 
   WHEN '1' THEN N'依借貸方'
   WHEN '2' THEN N'依原底稿'
   ELSE ""
   END AS "拋轉傳票排列方式"
  ,MA028 AS "假日加班費率計算方式"
  ,MA029 AS "雇主負擔退休金提撥率"
  ,MA030 AS "底薪換算每小時加班費基數"
  ,CASE 
   WHEN '1' THEN N'千元'
   WHEN '2' THEN N'五百元'
   WHEN '3' THEN N'二百元'
   WHEN '4' THEN N'元'
   ELSE ""
   END AS "本幣實付薪資取位"
  ,MA032 AS "下半月全月給薪日"
  ,MA033 AS "本國幣別為越盾"
  ,MA034 AS "代扣保險費三"
  ,MA035 AS "稅額不足扣款項目"
  ,MA036 AS "越南幣別"
  ,CASE 
   WHEN '1' THEN N'四捨五入'
   WHEN '2' THEN N'無條件進位'
   WHEN '3' THEN N'無條件捨去'
   ELSE ""
   END AS "本幣實付取位方式"
  ,MA044 AS "月薪換日薪除何值"
  ,MA045 AS "每小時之基數"
  ,MA046 AS "保險編號一"
  ,MA047 AS "保險名稱一"
  ,MA048 AS "員工負擔比率一"
  ,MA049 AS "僱主負擔比率一"
  ,MA050 AS "保險編號二"
  ,MA051 AS "保險名稱二"
  ,MA052 AS "員工負擔比率二"
  ,MA053 AS "僱主負擔比率二"
  ,MA054 AS "保險編號三"
  ,MA055 AS "保險名稱三"
  ,MA056 AS "員工負擔比率三"
  ,MA057 AS "僱主負擔比率三"
  ,MA058 AS "保險編號四"
  ,MA059 AS "保險名稱四"
  ,MA060 AS "員工負擔比率四"
  ,MA061 AS "僱主負擔比率四"
  ,MA062 AS "保險編號五"
  ,MA063 AS "保險名稱五"
  ,MA064 AS "員工負擔比率五"
  ,MA065 AS "僱主負擔比率五"
  ,MA066 AS "保險編號六"
  ,MA067 AS "保險名稱六"
  ,MA068 AS "員工負擔比率六"
  ,MA069 AS "僱主負擔比率六"
  ,MA070 AS "月薪者殘月時週日給薪"
  ,MA071 AS "最高投保薪資不可超過"
  ,MA072 AS "代扣保險費四"
  ,MA073 AS "代扣保險費五"
  ,MA074 AS "代扣保險費六"
  ,MA200 AS "大夜班上班津貼代號"
  ,MA201 AS "年假起算為到職日后"

FROM VPAMA
