--VPAMG_加班費條件資料檔
SELECT
  ,MG001 AS "加班費代號"
  ,MG002 AS "加班費名稱"
  ,MG003 AS "備註"
  ,MG004 AS "生效日期"
  ,MG005 AS "失效日期"
  ,MG006 AS "每小時加班費"
  ,CASE 
   WHEN '1' THEN N'員工底薪'
   WHEN '2' THEN N'員工出勤底薪'
   ELSE ""
   END AS "選擇底薪"
  ,MG008 AS "加班比率-平日(應稅)"
  ,MG009 AS "加班比率-平日(免稅)"
  ,MG010 AS "加班比率-假日(應稅)"
  ,MG011 AS "加班比率-假日(免稅)"
  ,MG012 AS "加班比率-假日夜間(應稅)"
  ,MG013 AS "加班比率-假日夜間(免稅)"
  ,MG014 AS "加班比率-國定或帶薪假(應稅)"
  ,MG015 AS "加班比率-國定或帶薪假(免稅)"
  ,MG016 AS "加班比率-國定或帶薪假夜間(應稅)"
  ,MG017 AS "加班比率-國定或帶薪假夜間(免稅)"
  ,MG018 AS "加班比率-大夜班(應稅)"
  ,MG019 AS "加班比率-大夜班(免稅)"
  ,MG020 AS "大夜班時間起(時:分)"
  ,MG021 AS "大夜班時間迄(時:分)"

FROM VPAMG
