--SASMA_會計科目設定
SELECT
  ,MA001 AS "銷售折讓科目編號-1"
  ,MA002 AS "銷售折讓科目編號-2"
  ,MA003 AS "銷售折讓科目編號-3"
  ,MA004 AS "銷售折讓科目編號-4"
  ,MA005 AS "銷售折讓科目編號-5"
  ,MA006 AS "銷售折讓科目編號-6"
  ,MA007 AS "銷售折讓科目編號-7"
  ,MA008 AS "銷售折讓科目編號-8"
  ,MA009 AS "銷售折讓科目編號-9"
  ,MA010 AS "銷售折讓科目編號-10"
  ,MA011 AS "壞帳損失科目編號-1"
  ,MA012 AS "壞帳損失科目編號-2"
  ,MA013 AS "壞帳損失科目編號-3"
  ,MA014 AS "壞帳損失科目編號-4"
  ,MA015 AS "壞帳損失科目編號-5"
  ,MA016 AS "壞帳損失科目編號-6"
  ,MA017 AS "壞帳損失科目編號-7"
  ,MA018 AS "壞帳損失科目編號-8"
  ,MA019 AS "壞帳損失科目編號-9"
  ,MA020 AS "壞帳損失科目編號-10"

FROM SASMA
