--ACTMC_會計系統參數檔
SELECT
  ,MC001 AS "借貸平衡"
  ,MC002 AS "總號輸入"
  ,MC003 AS "列印時借貸排列"
  ,MC004 AS "經營結果科目"
  ,MC005 AS "本期損益科目"
  ,MC006 AS "上期損益科目"
  ,MC007 AS "帳結單別"
  ,MC008 AS "應計回轉單別"
  ,MC009 AS "使用直接法現金流量表"
  ,CASE 
   WHEN 'N' THEN N'不需要'
   WHEN 'W' THEN N'僅需警告'
   WHEN 'Y' THEN N'必須指定'
   ELSE ""
   END AS "輸入傳票指定現金流量表項目"
  ,MC013 AS "過渡會科辨識碼"
  ,MC014 AS "其他權益科目之股東權益變動項目"
  ,MC015 AS "已轉換各系統相關會計科目設定資料"
  ,MC016 AS "借方在製科目(製費)"
  ,MC017 AS "借方在製科目(人工)"
  ,MC018 AS "貸方製費轉銷科目"
  ,MC019 AS "貸方人工轉銷科目"
  ,MC020 AS "本期損益科目之股東權益變動項目"
  ,MC021 AS "借方製費轉銷科目(閒置製費)"
  ,MC022 AS "貸方在製科目(製費)"
  ,MC023 AS "借方製費轉銷科目(期末差異)"
  ,MC024 AS "貸方在製科目(期末差異)"

FROM ACTMC
