--YPAMA_基本條件設置檔
SELECT
  ,MA001 AS "分上下月發薪"
  ,MA002 AS "日薪(上)計出勤"
  ,MA003 AS "日薪固定發薪幾天"
  ,MA004 AS "月薪(上)基本工資幾倍"
  ,MA005 AS "月薪換日薪除何值"
  ,MA006 AS "每小時的基數"
  ,MA007 AS "特休的請假扣款專案編號"
  ,MA008 AS "有刷卡系統"
  ,MA009 AS "上半月截止日期"
  ,MA010 AS "補休的請假扣款專案編號"
  ,MA011 AS "試用期滿日天數"
  ,MA012 AS "殘月天數包含節假日"
  ,MA013 AS "男退休年齡"
  ,MA014 AS "女退休年齡"
  ,CASE 
   WHEN '1' THEN N'拋轉自動分錄底稿'
   WHEN '2' THEN N'拋轉自動分錄底稿及會計憑證'
   ELSE ""
   END AS "拋轉方式"
  ,MA017 AS "拋轉憑證同底稿科目匯總"
  ,MA018 AS "薪資憑證單別"
  ,MA019 AS "借方摘要來源"
  ,MA020 AS "貸方摘要來源"
  ,MA021 AS "代扣所得稅"
  ,MA022 AS "應付費用科目"
  ,MA023 AS "請假單上半月截止日期"
  ,MA024 AS "加班單上半月截止日期"
  ,CASE 
   WHEN '1' THEN N'依借貸方'
   WHEN '2' THEN N'依原底稿'
   ELSE ""
   END AS "拋轉憑證排列方式"
  ,MA026 AS "假日加班費率計算方式"
  ,MA033 AS "計件工資"
  ,MA034 AS "計件在津貼扣款的項目編號"

FROM YPAMA
