--QMSMA_品管控制參數設定檔
SELECT
  ,MA001 AS "連續(正常->減量)"
  ,MA002 AS "拒收(正常->減量)"
  ,MA003 AS "連續(正常->加嚴)"
  ,MA004 AS "拒收(正常->加嚴)"
  ,MA005 AS "連續(減量->正常)"
  ,MA006 AS "拒收(減量->正常)"
  ,MA007 AS "連續(加嚴->正常)"
  ,MA008 AS "拒收(加嚴->正常)"
  ,MA009 AS "連續(加嚴->終止交易)"
  ,MA010 AS "拒收(加嚴->終止交易)"
  ,MA011 AS "啟動檢驗方式轉換規則"
  ,CASE 
   WHEN '1' THEN N'依檢驗項目自動判定'
   WHEN '2' THEN N'人工判定'
   ELSE ""
   END AS "判定之取決方式"
  ,MA013 AS "執行進貨檢驗程序"
  ,MA014 AS "執行製程移轉檢驗程序"
  ,MA015 AS "執行生產入庫檢驗程序"
  ,MA016 AS "執行託外進貨檢驗程序"
  ,MA019 AS "驗收後可修改原單據數量"
  ,MA022 AS "連續(正常->減量)"
  ,MA023 AS "拒收(正常->減量)"
  ,MA024 AS "連續(正常->加嚴)"
  ,MA025 AS "拒收(正常->加嚴)"
  ,MA026 AS "連續(減量->正常)"
  ,MA027 AS "拒收(減量->正常)"
  ,MA028 AS "連續(加嚴->正常)"
  ,MA029 AS "拒收(加嚴->正常)"
  ,MA030 AS "連續(加嚴->終止交易)"
  ,MA031 AS "拒收(加嚴->終止交易)"
  ,MA032 AS "啟動檢驗方式轉換規則"
  ,CASE 
   WHEN '1' THEN N'依檢驗項目自動判定'
   WHEN '2' THEN N'人工判定'
   ELSE ""
   END AS "判定之取決方式"
  ,MA034 AS "連續(正常->減量)"
  ,MA035 AS "拒收(正常->減量)"
  ,MA036 AS "連續(正常->加嚴)"
  ,MA037 AS "拒收(正常->加嚴)"
  ,MA038 AS "連續(減量->正常)"
  ,MA039 AS "拒收(減量->正常)"
  ,MA040 AS "連續(加嚴->正常)"
  ,MA041 AS "拒收(加嚴->正常)"
  ,MA042 AS "連續(加嚴->終止交易)"
  ,MA043 AS "拒收(加嚴->終止交易)"
  ,MA044 AS "啟動檢驗方式轉換規則"
  ,CASE 
   WHEN '1' THEN N'依檢驗項目自動判定'
   WHEN '2' THEN N'人工判定'
   ELSE ""
   END AS "判定之取決方式"
  ,MA046 AS "連續(正常->減量)"
  ,MA047 AS "拒收(正常->減量)"
  ,MA048 AS "連續(正常->加嚴)"
  ,MA049 AS "拒收(正常->加嚴)"
  ,MA050 AS "連續(減量->正常)"
  ,MA051 AS "拒收(減量->正常)"
  ,MA052 AS "連續(加嚴->正常)"
  ,MA053 AS "拒收(加嚴->正常)"
  ,MA054 AS "連續(加嚴->終止交易)"
  ,MA055 AS "拒收(加嚴->終止交易)"
  ,MA056 AS "啟動檢驗方式轉換規則"
  ,CASE 
   WHEN '1' THEN N'依檢驗項目自動判定'
   WHEN '2' THEN N'人工判定'
   ELSE ""
   END AS "判定之取決方式"

FROM QMSMA
